# HomeWork_3.10
## Задание 1. Написать приложение по определению чётного или нечётного числа.  
### Напишите приложение, которое определяет чётное или нечётное число. Алгоритм приложения выглядит следующим образом:  
* На экране программа с помощью оператора Console.WriteLine предлагает пользователю ввести целое число.  
* С помощью оператора Console.ReadLine считывается введённое число.  
* С помощью метода int.Parse число преобразуется в целочисленную переменную.  
* С помощью оператора деления с остатком определяется, чётное число или нечётное.  
* В зависимости от предыдущего шага на экран выводится текст, является ли данное число чётным или нет.  
_______________________________________________________________________________________________________________________________________________________
## Задание 2. Написать программу подсчёта суммы карт в игре «21».
 1. Программа приветствует пользователя и спрашивает, сколько у него на руках карт.
 2. Пользователь вводит целое число.
 3. Преобразуем это число в счётчик для цикла.
 4. С помощью цикла for итеративно просим пользователя ввести номинал каждой карты. Для карт с числовым номиналом он вводит только цифру. 
Для «картинок» следует принять обозначения латинскими буквами:
+ Валет = J
+ Дама = Q
+ Король = K
+ Туз = T
5. Внутри цикла, используя оператор switch, «вес» каждой карты складываем в общую переменную суммы, которая объявлена до тела основного цикла.
Для числовых карт их «вес» равен весу, указанному при вводе пользователем. Для «картинок» «вес» равен 10.
6. По завершении ввода на экране появится значение суммы карт.
_______________________________________________________________________________________________________________________________________________________
## Задание 3. Проверка простого числа.
 1. Реализуйте эту задачу, используя цикл while.
 2. Для начала пользователь вводит целое число.
 3. Затем в цикле нужно перебрать все числа, начиная с 1, и до N — 1.
 4. Входное число N при каждой итерации цикла нужно делить на число, которое получается в цикле с остатком. 
 5. Если остаток от деления равен 0, значит, программа нашла делитель этого числа, и потому это число уже не может являться простым числом.
 6. Если остаток от деления равен 0, то следует переменной bool, объявленной за рамками цикла, присвоить значение true.
 7. Если после выхода из цикла значение переменной осталось false, значит, число простое. Если значение переменной стало true — значит, был найден делитель, поэтому число не может считаться простым.
